-module(hh).

% 请写一个函数输入输入任意包含二元组和三元组得列表与键，用列表的形式返回该键所对应得所有值（不使用API，++，--）

% 例如 [{a, 1}, {b, 2, 22}, {b, 3}, {c ,4, 44}] 得到[{a,[1]},{b,[2,22,3]},{c,[4,44]}]
%
%
% -export([t1/1]).
-export([t/2]).

% t1(L)  ->
%     [{K1, [V1, V2]} ||   {K1, V1, V2} <- L].

% t1(L) ->
%     [X || X <- T,  T ]

t([{K, V} | Next], R) ->
    t(Next, [{K, [V]} | R]);
t([{K, V1, V2} | Next], R) ->
    t(Next, [{K, [V1, V2]} | R]);
t([], R) ->
    R.

% 把列表中的integer,float,atom转为字符串 并合并成一个字符串 不能用++ -- append concat
% 如 [1,a,1.2,"hello"] 转为 "1a1.2hello"
%
